<?php

namespace Database\Seeders;

use App\Models\Setting;
use App\Models\User;

// use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Database\Seeders\LanguageSeeder;

class DatabaseSeeder extends Seeder
{
    /**
     * Seed the application's database.
     * @throws \JsonException
     */
    public function run(): void
    {
        // Заполняем таблицу языков
        $this->call([
            LanguageSeeder::class,
        ]);
        
        Setting::create([
            'phone' => '+380660003202',
            'phone_view' => '<span>+38</span> 066 000 32 02',
            'telegram' => null,
            'instagram' => 'https://www.instagram.com/wrap.shop.kyiv/',
            'email' => 'info@wrap.shop',
            'address->uk' => '03039 Україна, Київ Вул. Ізюмська 5А',
            'address->en' => '03039 Україна, Київ Вул. Ізюмська 5А',
            'address->ru' => '03039 Україна, Київ Вул. Ізюмська 5А',
            'google_map_link' => 'https://maps.app.goo.gl/HHcBjcJbQnvUTmpJ7',
            'phone_aditional' => '+380660003202',
            'phone_aditional_view' => '<span>+38</span> 066 000 32 02',
            'video_banner_title->uk' => 'Стайлінг – наше життя',
            'video_banner_title->en' => 'Стайлінг – наше життя',
            'video_banner_title->ru' => 'Стайлінг – наше життя',
            'video_banner_desc->uk' => '<p><span style="font-size: 14px;">Wrap.Shop - ваш путівник у світ автомобільного вдосконалення та тюнінгу.</span></p><p><span style="font-size: 14px;">Кольорові та захисні плівки, інструменти для майстрів, продукти для догляду та детейлінгу, повний тюнінг авто - усе тут.</span></p>',
            'video_banner_desc->en' => '<p><span style="font-size: 14px;">Wrap.Shop - ваш путівник у світ автомобільного вдосконалення та тюнінгу.</span></p><p><span style="font-size: 14px;">Кольорові та захисні плівки, інструменти для майстрів, продукти для догляду та детейлінгу, повний тюнінг авто - усе тут.</span></p>',
            'video_banner_desc->ru' => '<p><span style="font-size: 14px;">Wrap.Shop - ваш путівник у світ автомобільного вдосконалення та тюнінгу.</span></p><p><span style="font-size: 14px;">Кольорові та захисні плівки, інструменти для майстрів, продукти для догляду та детейлінгу, повний тюнінг авто - усе тут.</span></p>',
            'slogan_title->uk' => 'Стайлінг – наше життя',
            'slogan_title->en' => 'Стайлінг – наше життя',
            'slogan_title->ru' => 'Стайлінг – наше життя',
            'slogan_desc->uk' => '<p>WrapShop - це найбільша мережа магазинів і установчих центрів, де ви можете купити автомобільні плівки (антигравійна, тонувальна, атермальна, вінілова), інструмент для роботи з автомобільними плівками (тонувальний інструмент, турбосушка), матеріали для детейлінгу.</p><p>Ми - піонери на ринку автомобільних плівок і були першими, хто привіз у 2008 році поліуретанову плівку в Україну. Ми є прямим імпортером і офіційним дистриб\'ютором таких брендів, як 3M, SunTek, LLumar, PremiumShield, Madico, Meguiar\'s, Lake</p><p>WrapShop - це найбільша мережа магазинів і установчих центрів, де ви можете купити автомобільні плівки (антигравійна, тонувальна, атермальна, вінілова), інструмент для роботи з автомобільними плівками (тонувальний інструмент, турбосушка), матеріали для детейлінгу.</p>      <p>Ми - піонери на ринку автомобільних плівок і були першими, хто привіз у 2008 році поліуретанову плівку в Україну. Ми є прямим імпортером і офіційним дистриб\'ютором таких брендів, як 3M, SunTek, LLumar, PremiumShield, Madico, Meguiar\'s, Lake</p><p>WrapShop - це найбільша мережа магазинів і установчих центрів, де ви можете купити автомобільні плівки (антигравійна, тонувальна, атермальна, вінілова), інструмент для роботи з автомобільними плівками (тонувальний інструмент, турбосушка), матеріали для детейлінгу.</p>      <p>Ми - піонери на ринку автомобільних плівок і були першими, хто привіз у 2008 році поліуретанову плівку в Україну. Ми є прямим імпортером і офіційним дистриб\'ютором таких брендів, як 3M, SunTek, LLumar, PremiumShield, Madico, Meguiar\'s, Lake</p>',
            'slogan_desc->en' => '<p>WrapShop - це найбільша мережа магазинів і установчих центрів, де ви можете купити автомобільні плівки (антигравійна, тонувальна, атермальна, вінілова), інструмент для роботи з автомобільними плівками (тонувальний інструмент, турбосушка), матеріали для детейлінгу.</p><p>Ми - піонери на ринку автомобільних плівок і були першими, хто привіз у 2008 році поліуретанову плівку в Україну. Ми є прямим імпортером і офіційним дистриб\'ютором таких брендів, як 3M, SunTek, LLumar, PremiumShield, Madico, Meguiar\'s, Lake</p><p>WrapShop - це найбільша мережа магазинів і установчих центрів, де ви можете купити автомобільні плівки (антигравійна, тонувальна, атермальна, вінілова), інструмент для роботи з автомобільними плівками (тонувальний інструмент, турбосушка), матеріали для детейлінгу.</p>      <p>Ми - піонери на ринку автомобільних плівок і були першими, хто привіз у 2008 році поліуретанову плівку в Україну. Ми є прямим імпортером і офіційним дистриб\'ютором таких брендів, як 3M, SunTek, LLumar, PremiumShield, Madico, Meguiar\'s, Lake</p><p>WrapShop - це найбільша мережа магазинів і установчих центрів, де ви можете купити автомобільні плівки (антигравійна, тонувальна, атермальна, вінілова), інструмент для роботи з автомобільними плівками (тонувальний інструмент, турбосушка), матеріали для детейлінгу.</p>      <p>Ми - піонери на ринку автомобільних плівок і були першими, хто привіз у 2008 році поліуретанову плівку в Україну. Ми є прямим імпортером і офіційним дистриб\'ютором таких брендів, як 3M, SunTek, LLumar, PremiumShield, Madico, Meguiar\'s, Lake</p>',
            'slogan_desc->ru' => '<p>WrapShop - це найбільша мережа магазинів і установчих центрів, де ви можете купити автомобільні плівки (антигравійна, тонувальна, атермальна, вінілова), інструмент для роботи з автомобільними плівками (тонувальний інструмент, турбосушка), матеріали для детейлінгу.</p><p>Ми - піонери на ринку автомобільних плівок і були першими, хто привіз у 2008 році поліуретанову плівку в Україну. Ми є прямим імпортером і офіційним дистриб\'ютором таких брендів, як 3M, SunTek, LLumar, PremiumShield, Madico, Meguiar\'s, Lake</p><p>WrapShop - це найбільша мережа магазинів і установчих центрів, де ви можете купити автомобільні плівки (антигравійна, тонувальна, атермальна, вінілова), інструмент для роботи з автомобільними плівками (тонувальний інструмент, турбосушка), матеріали для детейлінгу.</p>      <p>Ми - піонери на ринку автомобільних плівок і були першими, хто привіз у 2008 році поліуретанову плівку в Україну. Ми є прямим імпортером і офіційним дистриб\'ютором таких брендів, як 3M, SunTek, LLumar, PremiumShield, Madico, Meguiar\'s, Lake</p><p>WrapShop - це найбільша мережа магазинів і установчих центрів, де ви можете купити автомобільні плівки (антигравійна, тонувальна, атермальна, вінілова), інструмент для роботи з автомобільними плівками (тонувальний інструмент, турбосушка), матеріали для детейлінгу.</p>      <p>Ми - піонери на ринку автомобільних плівок і були першими, хто привіз у 2008 році поліуретанову плівку в Україну. Ми є прямим імпортером і офіційним дистриб\'ютором таких брендів, як 3M, SunTek, LLumar, PremiumShield, Madico, Meguiar\'s, Lake</p>',
        ]);
    }
}
