<?php
return [
  'title' => 'О wrap.shop',
  'description' => '<p>Wrap.Shop – ваш путеводитель в мир автомобильного усовершенствования и тюнинга.</p>
<p>Цветные и защитные пленки, инструменты для мастеров, продукты по уходу и детейлингу, полный тюнинг авто – все здесь. Добавьте еще стильную одежду и мерч, которые определенно подчеркнут ваш автомобильный образ.</p>
<p>Наш магазин всегда открыт для тех, кто ищет уникальность на дороге.</p>',

  'title_h2' => 'Команда wrap.shop',
  'description_after_h2' => '
<p>Нашей главной целью является создание удобной экосистемы для ателье по тюнингу и студиям в Украине, чтобы способствовать развитию этой отрасли.</p>
<p>Команда Wrap.Shop имеет опыт тюнинга автомобилей с 2007 года.</p>
<p>Мы сделаем ваши сложные задачи более простыми.</p>'
];
?>
