<?php

return [
    'reset'                 => 'Ваш пароль был сброшен!',
    'sent'                  => 'Мы отправили ссылку для сброса пароля на вашу почту!',
    'throttled'             => 'Пожалуйста, подождите перед повторной попыткой.',
    'token'                 => 'Этот токен сброса пароля недействителен.',
    'user'                  => "Мы не можем найти пользователя с таким email.",
    'reset_password'        => 'Восстановить пароль',
    'new_password_legend'   => 'Введите новый пароль.',
    'password'              => 'Пароль',
    'password_confirmation' => 'Подтверждение пароля',
    'submit'                => 'Продолжить',
];
