<?php
return [
  //header
  'title' => 'Доставка и оплата',
  'payment_options' => 'Варианты оплаты',
  'delivery_options' => 'Варианты доставки',
  'privat_24_by_QR_code' => [
    'title' => 'Приват 24 по QR-коду',
    'description' => 'Без комиссии. <br>*магазин может брать предоплату на некоторые группы товаров',
  ],
  'by_visa_mastercard' => [
    'title' => 'Карта Visa/MasterCard',
    'description' => 'Оплата онлайн возможна на этапе оформления заказа. При оформлении заказа выберите пункт Оплата банковской картой Visa/MasterCard. Для оплаты Вы будете переадресованы на страницу системы безопасных платежей, где необходимо подтвердить оплату.',
  ],
  'cash_on_delivery' => [
    'title' => 'Наличными при получении',
    'description' => 'Оплата производится исключительно в национальной валюте гривны и может быть произведена в любой из наших торговых точек на территории Украины или через курьера в Киеве (комиссия 0%).<br>*магазин может брать предоплату на некоторые группы товаров',
  ],

  'delivery_nova_poshta' => [
    'title' => 'Доставка “Новая почта”',
    'description' => 'Доставка осуществляется службой Новая почта по всей Украине. Стоимость доставки оплачивается получателем согласно тарифам Новой почты.',
  ],
  'address_delivery' => [
    'title' => 'Адресная доставка',
    'description' => 'Адресная курьерская доставка доступна в городе Киев. Сроки доставки: в течении 3 часов.',
  ],
  'pickup' => [
    'title' => 'Самовывоз',
    'description' => 'Заказ можно самостоятельно принять в тюнинг-ателье SouthArt по адресу:<br><strong>г. Киев, ул. Изюмская 5а.</strong>',
  ],

];
?>
