<?php
return [
    'update-account' => 'Успешно: ваша учетная запись была успешно обновлена.',
    'update-password' => 'Ваш пароль был успешно обновлен.',
    'add-address' => 'Ваш адрес был успешно добавлен',
    'update-address' => 'Ваш адрес был успешно обновлен',
    'delete-address' => 'Ваш адрес был успешно удален',
    'checkout' => [
        'your_order' => 'Ваш заказ принят!',
        'lead' => 'История заказа доступна в личном кабинете.',
        'account' => 'Личный кабинет',
        'order_history' => 'История заказов',
        'questions' => 'Если у вас возникли вопросы, пожалуйста <a href=":url">свяжитесь с нами</a>.',
        'thanks' => 'Спасибо за покупки в нашем интернет-магазине!',
        'continue' => 'Продолжить',
    ],
];
