<?php
return [
  'name.required' => 'Имя должно быть от 3 до 12 символов!',
  'last_name.required' => 'Фамилия должна быть от 3 до 15 символов!',
  'email.email' => 'Некорректный адрес электронной почты!',
  'email.unique' => 'Адрес уже зарегистрирован!',
  'phone.required' => 'Заполните номер телефона',
  'phone.regex' => 'Проверьте правильность ввода номера телефона!',
  'password.required' => 'Пароль должен быть от 8 до 20 символов!',
  'password.confirmed' => 'Подтверждение пароля не совпадает.',
  'field.required' => 'Это поле обязательно!'

]
?>
