<?php
return [
  'title' => 'Про wrap.shop',
  'description' => '<p>Wrap.Shop - ваш путівник у світ автомобільного вдосконалення та тюнінгу.</p>
<p>Кольорові та захисні плівки, інструменти для майстрів, продукти для догляду та детейлінгу, повний тюнінг авто - усе тут. Додайте ще стильний одяг і мерч, які виразно підкреслять ваш автомобільний образ.</p>
<p>Наш магазин завжди відкритий для тих, хто шукає унікальність на дорозі.</p>',

  'title_h2' => 'Команда wrap.shop',
  'description_after_h2' => '
<p>Нашою головною метою є створення зручної екосистеми для ательє з тюнінгу та студій в Україні, щоб сприяти розвитку цієї галузі.</p>
<p>Команда Wrap.Shop має досвід тюнінгу автомобілів з 2007 року.</p>
<p>Ми зробимо ваші складні задачі простішими.</p>'
];
?>
