<?php

return [
    'reset'                 => 'Ваш пароль було скинуто!',
    'sent'                  => 'Ми надіслали вам посилання для скидання пароля!',
    'throttled'             => 'Будь ласка, зачекайте перед повторною спробою.',
    'token'                 => 'Цей токен для скидання пароля є недійсним.',
    'user'                  => "Ми не можемо знайти користувача з такою електронною адресою.",
    'reset_password'        => 'Відновити пароль',
    'new_password_legend'   => 'Введіть новий пароль.',
    'password'              => 'Пароль',
    'password_confirmation' => 'Підтвердження пароля',
    'submit'                => 'Продовжити',
];
