<?php
return [
  //header
  'title' => 'Доставка та оплата',
  'payment_options' => 'Варіанти оплати',
  'delivery_options' => 'Варіанти доставки',
  'privat_24_by_QR_code' => [
    'title' => 'Приват 24 за QR-кодом',
    'description' => 'Без комісії. <br>*магазин може брати передсплату на деякі групи товарів',
  ],
  'by_visa_mastercard' => [
    'title' => 'Картою Visa/MasterCard',
    'description' => 'Оплата онлайн можлива на етапі оформлення замовлення. Під час оформлення замовлення, виберіть пункт Оплата банківською картою Visa/MasterCard. Для оплати, Ви будете переадресовані на сторінку системи безпечних платежів, де необхідно підтвердити оплату.',
  ],
  'cash_on_delivery' => [
    'title' => 'Готівкою при отриманні',
    'description' => 'Оплата здійснюється виключно у національній валюті гривні і може бути проведена в будь-якій з наших торгових точок на території України або через курʼєра в Києві (комісія 0%).<br>*магазин може брати передсплату на деякі групи товарів',
  ],

  'delivery_nova_poshta' => [
    'title' => 'Доставка “Нова пошта”',
    'description' => 'Доставка здійснюється службою Нова пошта по всій Україні. Вартість доставки сплачується отримувачем згідно з тарифів Нової пошти.',
  ],
  'address_delivery' => [
    'title' => 'Адресна доставка',
    'description' => 'Адресна курʼєрська доставка доступна в місті Київ. Терміни доставки: протягом 3 годин.',
  ],
  'pickup' => [
    'title' => 'Самовивіз з Ательє',
    'description' => 'Замовлення можна самостійно прийняти у тюнінг-ательє SouthArt за адресою:<br><strong>м. Київ, вул. Ізюмська 5а.</strong>',
  ],

];
?>
