<?php
return [
    'update-account' => 'Успішно: ваш обліковий запис було успішно оновлено.',
    'update-password' => 'Ваш пароль було успішно оновлено.',
    'add-address' => 'Вашу адресу було успішно додано',
    'update-address' => 'Вашу адресу було успішно оновлено',
    'delete-address' => 'Вашу адресу було успішно видалено',
    'checkout' => [
        'your_order' => 'Ваше замовлення прийняте!',
        'lead' => 'Історія замовлення доступна в особистому кабінеті.',
        'account' => 'Особистий кабінет',
        'order_history' => 'Історія замовлень',
        'questions' => 'Якщо у вас виникли питання, будь ласка <a href=":url">зв\'яжіться з нами</a>.',
        'thanks' => 'Дякуємо за покупки в нашому інтернет-магазині!',
        'continue' => 'Продовжити',
    ],
];
