<?php
return [
    'update-account' => 'Успішно: ваш обліковий запис було успішно оновлено.',
    'update-password' => 'Ваш пароль було успішно оновлено.',
    'add-address' => 'Вашу адресу було успішно додано',
    'update-address' => 'Вашу адресу було успішно оновлено',
    'delete-address' => 'Вашу адресу було успішно видалено',
    'checkout' => [
        'your_order' => 'Ваше замовлення прийняте!',
        'your_order_description' => '<p>Ваше замовлення прийняте!</p>
            <p>Історія замовлення знаходиться в <a href="' . route('account') . '">Особистому кабінеті</a>.
            Для перегляду історії, перейдіть по посиланню <a href="' . route('order') . '">Історія замовлень</a>.</p>
            <p style="display:none">Если ваша покупка связана с загрузкой, вы можете перейти в личный кабинет на страницу <a href="#">загрузки</a> для их просмотра.</p>
            <p>Якщо у Вас виникли питання, будь ласка <a href="' . route('contacts') . '">зв\'яжіться з нами</a>.</p>
            <p><strong>Дякуємо за покупки в нашому інтернет-магазині!</strong></p>',
        'continue' => 'Продовжити',
    ],
];
