<?php
return [
  'name.required' => 'Ім\'я має бути від 3 до 12 символів!',
  'last_name.required' => 'Прізвище має бути від 3 до 15 символів!',
  'email.email' => 'Некоректна адреса електронної пошти!',
  'email.unique' => 'Адреса вже зареєстрована!',
  'phone.required' => 'Заповніть номер телефону',
  'phone.regex' => 'Перевірте правильність вводу номера телефону!',
  'password.required' => 'Пароль має бути від 8 до 20 символів!',
  'password.confirmed' => 'Підтвердження паролю не збігається.',
  'field.required' => 'Це поле обов\'язкове!'
]
?>
